Plan for **staging** is ready.
**Branch/Commit:** refs/heads/staging / f32faa1f7ae0078be2f6b2c31b0ac918aeb22b3b
**Run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/19658157644

**Plan (last ~500 lines):**
```
    }

  # module.helm.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.helm.data.aws_subnets.public will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_subnets" "public" {
      + id   = (known after apply)
      + ids  = (known after apply)
      + tags = (known after apply)

      + filter {
          + name   = "tag:kubernetes.io/cluster/platform-stg"
          + values = [
              + "shared",
            ]
        }
      + filter {
          + name   = "tag:kubernetes.io/role/elb"
          + values = [
              + "1",
            ]
        }
      + filter {
          + name   = "vpc-id"
          + values = [
              + "vpc-0a70acbb21ce13437",
            ]
        }
    }

  # module.helm.aws_iam_policy.external_dns_policy["this"] will be updated in-place
  ~ resource "aws_iam_policy" "external_dns_policy" {
        id               = "arn:aws:iam::107363237542:policy/eks/platform-stg/platform-stg-external-dns"
        name             = "platform-stg-external-dns"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "route53:ChangeResourceRecordSets"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::hostedzone/*"
                    },
                  - {
                      - Action   = [
                          - "route53:ListTagsForResource",
                          - "route53:ListResourceRecordSets",
                          - "route53:ListHostedZones",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "stg"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (7 unchanged attributes hidden)
    }

  # module.helm.aws_iam_policy.load_balancer_controller_policy["this"] will be updated in-place
  ~ resource "aws_iam_policy" "load_balancer_controller_policy" {
        id               = "arn:aws:iam::107363237542:policy/eks/platform-stg/platform-stg-lbc"
        name             = "platform-stg-lbc"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "elasticloadbalancing:DescribeTargetHealth",
                          - "elasticloadbalancing:DescribeTargetGroups",
                          - "elasticloadbalancing:DescribeTargetGroupAttributes",
                          - "elasticloadbalancing:DescribeTags",
                          - "elasticloadbalancing:DescribeSSLPolicies",
                          - "elasticloadbalancing:DescribeRules",
                          - "elasticloadbalancing:DescribeLoadBalancers",
                          - "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          - "elasticloadbalancing:DescribeListeners",
                          - "elasticloadbalancing:DescribeListenerCertificates",
                          - "elasticloadbalancing:DescribeListenerAttributes",
                          - "ec2:GetCoipPoolUsage",
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeInternetGateways",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeCoipPools",
                          - "ec2:DescribeAvailabilityZones",
                          - "ec2:DescribeAddresses",
                          - "ec2:DescribeAccountAttributes",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "wafv2:GetWebACLForResource",
                          - "wafv2:GetWebACL",
                          - "wafv2:DisassociateWebACL",
                          - "wafv2:AssociateWebACL",
                          - "waf-regional:GetWebACLForResource",
                          - "waf-regional:GetWebACL",
                          - "waf-regional:DisassociateWebACL",
                          - "waf-regional:AssociateWebACL",
                          - "shield:ListProtections",
                          - "shield:GetSubscriptionState",
                          - "shield:DescribeSubscription",
                          - "shield:DescribeProtection",
                          - "shield:DeleteProtection",
                          - "shield:CreateProtection",
                          - "iam:ListServerCertificates",
                          - "iam:GetServerCertificate",
                          - "cognito-idp:DescribeUserPoolClient",
                          - "acm:ListCertificates",
                          - "acm:DescribeCertificate",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ec2:RevokeSecurityGroupIngress",
                          - "ec2:RevokeSecurityGroupEgress",
                          - "ec2:DeleteTags",
                          - "ec2:DeleteSecurityGroup",
                          - "ec2:CreateTags",
                          - "ec2:CreateSecurityGroup",
                          - "ec2:AuthorizeSecurityGroupIngress",
                          - "ec2:AuthorizeSecurityGroupEgress",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:RegisterTargets",
                          - "elasticloadbalancing:DeregisterTargets",
                          - "elasticloadbalancing:DeleteTargetGroup",
                          - "elasticloadbalancing:DeleteRule",
                          - "elasticloadbalancing:DeleteLoadBalancer",
                          - "elasticloadbalancing:DeleteListener",
                          - "elasticloadbalancing:CreateTargetGroup",
                          - "elasticloadbalancing:CreateRule",
                          - "elasticloadbalancing:CreateLoadBalancer",
                          - "elasticloadbalancing:CreateListener",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:RemoveTags",
                          - "elasticloadbalancing:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:SetWebAcl",
                          - "elasticloadbalancing:SetSubnets",
                          - "elasticloadbalancing:SetSecurityGroups",
                          - "elasticloadbalancing:SetIpAddressType",
                          - "elasticloadbalancing:RemoveListenerCertificates",
                          - "elasticloadbalancing:ModifyTargetGroupAttributes",
                          - "elasticloadbalancing:ModifyTargetGroup",
                          - "elasticloadbalancing:ModifyRule",
                          - "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          - "elasticloadbalancing:ModifyListener",
                          - "elasticloadbalancing:AddListenerCertificates",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "iam:CreateServiceLinkedRole"
                      - Condition = {
                          - StringEquals = {
                              - "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "stg"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (7 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_ebs_csi_controller["this"] will be updated in-place
  ~ resource "aws_iam_role" "eks_ebs_csi_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::107363237542:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "platform-stg-ebs-csi"
        name                  = "platform-stg-ebs-csi"
        tags                  = {
            "Environment" = "stg"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (11 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_external_dns["this"] will be updated in-place
  ~ resource "aws_iam_role" "eks_external_dns" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::107363237542:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "platform-stg-external-dns"
        name                  = "platform-stg-external-dns"
        tags                  = {
            "Environment" = "stg"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (11 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_load_balancer_controller["this"] will be updated in-place
  ~ resource "aws_iam_role" "eks_load_balancer_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::107363237542:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "platform-stg-lbc"
        name                  = "platform-stg-lbc"
        tags                  = {
            "Environment" = "stg"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (11 unchanged attributes hidden)
    }

  # module.helm.helm_release.aws_load_balancer_controller["this"] will be updated in-place
  ~ resource "helm_release" "aws_load_balancer_controller" {
        id                         = "aws-load-balancer-controller"
      ~ metadata                   = [
          - {
              - app_version    = "v2.16.0"
              - chart          = "aws-load-balancer-controller"
              - first_deployed = 1764042737
              - last_deployed  = 1764042737
              - name           = "aws-load-balancer-controller"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    AWS Load Balancer controller installed!
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - clusterName    = "platform-stg"
                      - region         = "us-east-1"
                      - serviceAccount = {
                          - annotations = {
                              - "eks.amazonaws.com/role-arn" = "arn:aws:iam::107363237542:role/eks/platform-stg/platform-stg-lbc"
                            }
                          - create      = false
                          - name        = "aws-load-balancer-controller"
                        }
                      - vpcId          = "vpc-0a70acbb21ce13437"
                    }
                )
              - version        = "1.16.0"
            },
        ] -> (known after apply)
        name                       = "aws-load-balancer-controller"
        # (26 unchanged attributes hidden)

      - set {
          - name  = "region" -> null
          - value = "us-east-1" -> null
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "region"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.network.helm_release.cilium will be updated in-place
  ~ resource "helm_release" "cilium" {
        id                         = "cilium"
      ~ metadata                   = [
          - {
              - app_version    = "1.18.1"
              - chart          = "cilium"
              - first_deployed = 1764042642
              - last_deployed  = 1764042642
              - name           = "cilium"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    You have successfully installed Cilium with Hubble Relay and Hubble UI.
                    
                    Your release version is 1.18.1.
                    
                    For any further help, visit https://docs.cilium.io/en/v1.18/gettinghelp
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - egressMasqueradeInterfaces = "eth+"
                      - endpointRoutes             = {
                          - enabled = true
                        }
                      - eni                        = {
                          - awsEnablePrefixDelegation = true
                          - enabled                   = true
                          - subnetTagsFilter          = [
                              - "cilium-pod-subnet=true",
                            ]
                        }
                      - envoy                      = {
                          - enabled = true
                        }
                      - gatewayAPI                 = {
                          - enabled = true
                        }
                      - hubble                     = {
                          - enabled = true
                          - relay   = {
                              - enabled = true
                            }
                          - tls     = {
                              - auto = {
                                  - enabled = true
                                  - method  = "helm"
                                }
                            }
                          - ui      = {
                              - enabled = true
                              - ingress = {
                                  - className = "cilium"
                                  - enabled   = true
                                  - hosts     = [
                                      - "hubble-stg.107363237542.montlabz.com",
                                    ]
                                  - paths     = [
                                      - {
                                          - path     = "/"
                                          - pathType = "Prefix"
                                        },
                                    ]
                                }
                            }
                        }
                      - ingressController          = {
                          - enabled          = true
                          - loadbalancerMode = "shared"
                          - service          = {
                              - annotations = {
                                  - "service.beta.kubernetes.io/aws-load-balancer-scheme" = "internet-facing"
                                  - "service.beta.kubernetes.io/aws-load-balancer-type"   = "network"
                                }
                              - type        = "LoadBalancer"
                            }
                        }
                      - ipam                       = {
                          - mode = "eni"
                        }
                      - k8sServiceHost             = "2A7038AE3A9012C7E59F6F481F1A1435.gr7.us-east-1.eks.amazonaws.com"
                      - k8sServicePort             = 443
                      - kubeProxyReplacement       = true
                      - routingMode                = "native"
                    }
                )
              - version        = "1.18.1"
            },
        ] -> (known after apply)
        name                       = "cilium"
        # (27 unchanged attributes hidden)

      - set {
          - name  = "envoy.enabled" -> null
          - value = "true" -> null
            # (1 unchanged attribute hidden)
        }
      - set {
          - name  = "gatewayAPI.enabled" -> null
          - value = "true" -> null
            # (1 unchanged attribute hidden)
        }
      - set {
          - name  = "hubble.ui.ingress.className" -> null
          - value = "cilium" -> null
            # (1 unchanged attribute hidden)
        }
      - set {
          - name  = "ingressController.enabled" -> null
          - value = "true" -> null
            # (1 unchanged attribute hidden)
        }
      - set {
          - name  = "ingressController.loadbalancerMode" -> null
          - value = "shared" -> null
            # (1 unchanged attribute hidden)
        }
      - set {
          - name  = "ingressController.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-scheme" -> null
          - value = "internet-facing" -> null
            # (1 unchanged attribute hidden)
        }
      - set {
          - name  = "ingressController.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-type" -> null
          - value = "network" -> null
            # (1 unchanged attribute hidden)
        }
      - set {
          - name  = "ingressController.service.type" -> null
          - value = "LoadBalancer" -> null
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "hubble.ui.ingress.className"
          + value = "nginx"
            # (1 unchanged attribute hidden)
        }

        # (19 unchanged blocks hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```
